Revit 2024 API
EnergyAnalysisMaterial.ThermalConductivity Property
 The thermal conductivity of the material.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double ThermalConductivity { get; }
Visual Basic
Public ReadOnly Property ThermalConductivity As Double
	Get
Visual C++
public:
property double ThermalConductivity {
	double get ();
}
See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace